1) Какие у вас ожидания от курса? Есть ли конкретные вопросы по теме Базы данных?
Хочется освоить в полной мере, и применить на практике. Например у моей супруги свое небольшое дело (Шьет на заказ) часто проблемы с ведением заказов.
Так вот хотелосьбы сделать базу данных заказав для начала с подробным и удобным учетом а в последствии переделать это в интернет магазин с формами для заказов. 
Но пока знаний вовсе нет. Будем стараться

2) В какой сфере работаете сейчас?
Черная металлургия, электромонтер-релейщик.

3) Если в IT, то какой у вас опыт (инструменты, технологии, языки программирования)?
В IT По немного подрабатываю системным администратором у небольшого розничного магазина, на базе знаний из колледжа.
В принципе мы всё затрагивали в колледже, то что сейчас проходим. Конечно там был уровень по ниже, возраст был не тот))
Но в целом представление есть о БД. Проходил предвыпускную практику на предприятии, на котором сейчас работаю. 
Там был в управлении подбора и подготовки персонала. Пердложил им небольшой проект, базу данных кадрового резерва.
Получил разрешение у службы безопасности, и учетку для администрирования сервера. Поставил им MySQL сервер, создал БД, и написал программу-клиент на Delphi.
Программа работает и по сей день) Очень приятно
Правда после колледжа ушел в армию, а вернувшись устроился в энергетику, где работаю по сей день.
